const beginnerParagraphs = [
    "ខ្ញុំ​ចង់​ទៅផ្ទះ",
    "ខ្ញុំ​ស្រលាញ់​នាង",
    "តើអ្នកចង់ញ៉ាំបាយទេ?",
    "តោះទៅសៀមរាប",
    "ខ្ញុំចង់រៀនភាសាបារាំង",
    "ខ្តើ​អ្នក​រស់នៅ​ឯណា?",
    "តើ​អ្នក​ចង់​ទៅណា?",
    "ខ្ញុំ​ចង់​ទៅផ្ទះ",
    "តើអ្នកនឹងត្រលប់មកផ្ទះនៅពេលណា?",
    "ខ្ញុំរស់នៅទីក្រុងភ្នំពេញ",
    "ខ្ញុំចង់លេងវីដេអូហ្គេម",
    "ខ្ញុំធុញណាស់",
    "តើអ្នកមិនអីទេ?",
    "តើអ្នកនៅឯណា?",
    "នាងកំពុងសម្លឹងមើលអ្នក។",
    "សូមស្វាគមន៍មកកាន់ការិយាល័យរបស់យើង",
    "ពេលណាចូលឆ្នាំខ្មែរខាងមុខ?",
    "ខ្ញុំស្រលាញ់ម៉ាក់",
    "ខ្ញុំស្រឡាញ់គ្រួសាររបស់ខ្ញុំ",
    "ខ្ញុំមានមិត្តប្រុសរួចហើយ",
    "តើអ្នកភ្លេចទេ?",
    "តើអ្នកចង់ទៅប្រទេសចិនទេ?",
    "តើអ្នកទៅណា?",
    "តើអ្នកនឹងធ្វើអ្វីបន្ទាប់ពីវិទ្យាល័យ?",
    "ខ្ញុំរៀននៅវិទ្យាល័យព្រះស៊ីសុវត្ថិ",
    "ខ្ញុំទទួលបាននិទ្ទេស អេ",
    "ខ្ញុំចង់ទៅសិក្សានៅប្រទេសកូរ៉េ",
    "ខ្ញុំស្រឡាញ់ប្រទេសរបស់ខ្ញុំ",
    "តើអ្នកចង់ទៅប្រទេសជប៉ុនទេ?",
    "ខ្ញុំចូលចិត្តសរសេរកូដ",
    "អ្នកមិនមានចំណេះដឹងទេ",
    "ខ្ញុំស្រឡាញ់ប្រវត្តិសាស្ត្រ",
    "អរគុណសន្តិភាព",
    "ខ្ញុំស្រឡាញ់ស្តេចរបស់ខ្ញុំ",
    "ខ្ញុំ​ឈឺ​ហើយ",
    "ខ្ញុំចង់សិក្សានៅបរទេស"
  ];
  
  const advancedParagraphs = [
    "តើអ្នកនឹងទៅផ្ទះនៅពេលណា? ខ្ញុំ​នឹក​អ្នក​ខ្លាំង​ណាស់ ខ្ញុំ​នឹង​ធ្វើ​ម្ហូប​ឆ្ងាញ់ៗ​ជូន​អ្នក ពេល​អ្នក​មក​ដល់​ផ្ទះ",
    "ក្រុងភ្នំពេញ​ ប្រទេសកម្ពុជាជាប់ចំណាត់លេខ២​ បន្ទាប់ពីសិង្ហបុរី​ ជាប្រទេសដែលមានការចំណាយខ្ពស់",
    "ថ្ងៃបទបង្ហាញជាសាធារណៈ ដែលជាវគ្គផ្តាច់ព្រ័ត្រនៃកម្មវិធី",
    "ចំណាយពេលវេលាដ៏មានតម្លៃចូលរួមចែករំលែកចំណេះដឹង និងបទពិសោធន៍អំពីប្រធានបទ",
    "អ្នកឧកញ៉ា គិត ម៉េង៖ បារាំងជាដៃគូពាណិជ្ជកម្មអឺរ៉ុបធំទីពីររបស់កម្ពុជា បន្ទាប់ពីប្រទេសអាល្លឺម៉ង់",
    "ចាប់ពីថ្ងៃនេះ ដល់ថ្ងៃទី១ ខែកក្កដា កម្ពុជាបន្តមានភ្លៀងធ្លាក់ ជាមួយផ្គររន្ទះ និងខ្យល់បោកបក់ គ្របដណ្តប់លើផ្ទៃដីពី៥-១៥%",
    "អបអរសាទរ! រថយន្តដឹកជញ្ជូនទំនិញសាកល្បងពីប្រទេសចិន លើចម្ងាយផ្លូវជាង២០០០គីឡូម៉ែត្រ បានមកដល់រាជធានីភ្នំពេញ ដោយជោគជ័យ",
    "កុំខកខានឱ្យសោះ! ចាប់ពីថ្ងៃនេះ ដល់ថ្ងៃទី៣០ ខែមិថុនា មហាជន​អាចទស្សនាភាពយន្ដជាង១៥០រឿងឥតគិតថ្លៃ នៅរោងកុនចំនួន១០ ទូទាំងរាជធានីភ្នំពេញ",
    "ហ្វីលីពីន​ ដែលជាប្រទេសទិញអង្ករដ៏ធំបំផុតមួយរបស់ពិភពលោក ប្រកាសទម្លាក់​ពន្ធ​នាំ​ចូល​អង្ករ​ពី ៣៥% មក​ត្រឹម ១៥% ដើម្បីដោះស្រាយអតិផរណា",
    "សេចក្ដីប្រកាសព័ត៌មានស្ដីពី ធុរកិច្ចថ្មីឆ្នើម ដែលទទួលបានទុនវិនិយោគពី កម្មវិធីពន្លឿនអាជីវកម្មថ្នាលឌីជីថលរដូវកាលទី ៣ នាថ្ងៃបទបង្ហាញសាធារណៈ",
    "កម្មវិធីពន្លឿនអាជីវកម្មថ្នាលឌីជីថលរដូវកាលទី ៣ គឺជាកម្មវិធីដែលផ្តោតសំខាន់ទៅលើការបំប៉នចំណេះដឹងបន្ថែម និង ការគាំទ្រជាច្រើនផ្សេងទៀត ដល់ធុរកិច្ចថ្មីដែលកំពុងមានជាថ្នាលឌីជីថល",
    "កម្ពុជា កំពុងពិនិត្យលទ្ធភាពក្នុងការដាក់ទុនវិនិយោគរបស់ក្រុមហ៊ុនជប៉ុន លើធនធានរ៉ែ និងហេដ្ឋារចនាសម្ព័ន្ធផ្លូវល្បឿនលឿន",
    "សម្ដេចតេជោ ហ៊ុន សែន ស្នើរាជរដ្ឋាភិបាលរៀបចំ ទូងស្គរ បាញ់កាំជ្រួចអបអរសាទរនៅគ្រប់ទីកន្លែង នៅថ្ងៃទី៥ ខែសីហាខាងមុខ ដើម្បីគាំទ្រ«គម្រោងព្រែកជីកហ្វូណនតេជោ»",
    "សម្ដេចព្រះមហាអរិយវង្សបណ្ឌិត យ៉ន សេង យៀត ត្រូវបានតែងតាំងជាព្រះចៅអធិការវត្តឧណ្ណាលោម",
    "ការសិក្សាមួយបង្ហាញថា សិង្ហបុរីជាប្រទេសដែលអាចប្រឈមនឹងបញ្ហាបាត់បង់ការងារដោយសារតែ អេអាយ ខ្ពស់ជាងគេនៅតំបន់អាស៊ី",
    "ដ្ឋមន្ត្រីក្រសួងកសិកម្ម ៖ កម្ពុជាបាននិងកំពុងធ្វើការជំរុញវិស័យកៅស៊ូ ឱ្យក្លាយជាដំណាំឧស្សាហកម្ម មានទីផ្សារខ្ពស់ និងអាចកែច្នៃជាផលិតផលសម្រេចផ្សេងៗ",
    "សញ្ញាល្អ! ក្រុមហ៊ុនចិនធំមួយ កំពុងរៀបចំគម្រោងពង្រីកខ្សែច្រវាក់ផលិតកម្មរបស់ខ្លួននៅកម្ពុជា ដែលមានទំហំទឹកប្រាក់ស្ថិតក្នុងរង្វង់ ១ពាន់លានដុល្លារ",
    "ក្រសួងរៀបចំដែនដី បដិសេធសំណើសុំចុះបញ្ជីដីធ្លីចំនួន ២ទីតាំង មានទំហំសរុបជាង ៤០០ហិកតា ដែលស្ថិតក្នុងទីតាំងដីរបស់រដ្ឋ",
    "អបអរសាទរ! ប្រាសាទអង្គរវត្ត ជាប់ចំណាត់ថ្នាក់ជាគោលដៅទាក់ទាញទេសចរណ៍ល្អបំផុតលំដាប់ទី១២ លើពិភពលោក",
    "មន្រ្តីនគរបាលជាតិជាន់ខ្ពស់ បញ្ជាក់ថា ការត្រួតពិនិត្យជាតិស្រវឹងពេលយប់កាត់បន្ថយគ្រោះថ្នាក់ចរាចរណ៍ជាង ៥០ភាគរយ",
    "អ្នកឡើងភ្នំ ហ្វូជី ចំនួន ៤នាក់បានបាត់បង់ជីវិត ស្របពេលរដូវកាលដើរឡើងភ្នំរដូវក្ដៅនៅប្រទេសជប៉ុនជិតចាប់ផ្ដើម",
    "អាជ្ញាធរខេត្តកំពត កំពុងរៀបចំសាងសង់នាឡិកាកម្ពស់ជាង ៣០ម៉ែត្រ ដើម្បីទាក់ទាញភ្ញៀវទេសចរ",
    "ហ្វាំងឡង់គ្រោងចាក់វ៉ាក់សាំងការពារជំងឺផ្តាសាយបក្សីជូនពលរដ្ឋខ្លួនជាលើកដំបូងនៅលើពិភពលោក",
    "កម្ពុជា មានសហគ្រាស ធុនមីក្រូ តូច និងមធ្យមចំនួន ៧៥៣ ៦៧០ មូលដ្ឋាន និងបានចូលរួមក្នុងផលិតផលក្នុងស្រុកសរុបស្មើ៦៣%",
    "ដល់ពេលហើយអ្នកទាំងអស់គ្នា គុនខ្មែររបស់ពិត! មួយរយៈនេះកីឡាករគុនខ្មែរយើងចេញមុខលើសង្វៀនក្រៅប្រទេសជាបន្តបន្ទាប់",
    "រៀបចំក្រោយមែនពិត តែក្រុមកសិករអ្នកដាំស្វាយចន្ទីនៅឃុំទំរីង ស្រុកសណ្តាន់ ខេត្តកំពង់ធំ នឹងក្លាយជាសហគមន៍កសិកម្មទំនើបដំបូងគេសម្រាប់ដំណាំស្វាយចន្ទី",
    "ពលរដ្ឋជប៉ុន ៨០នាក់បានបាត់បង់ជីវិតដោយសារការប្រើប្រាស់អាហារបំប៉នសុខភាពប្រភេទនេះ",
    "ក្រុមហ៊ុន​ជប៉ុនមួយ កំពុងពិនិត្យលទ្ធភាពលើការដាក់ទុន វិនិយោគហេដ្ឋារចនាសម្ព័ន្ធផ្លូវល្បឿនលឿននៅកម្ពុជា",
    "ខេត្តកែប មានសហគមន៍នេសាទចំនួន៥ និងទូកនេសាទចំនួន ៥៩៤ទូក ខណៈផលនេសាទមានការកើនឡើងបន្តិចបន្តួចប៉ុណ្ណោះ",
    "សហភាពអឺរ៉ុបជឿជាក់ថា ការអប់រំសម្រាប់ទាំងអស់គ្នា គឺជាគន្លឹះដ៏សំខាន់ក្នុងការជំរុញឱ្យយុវជនកម្ពុជាអាចឈានទៅសម្រេចបានសក្តានុពលរបស់ខ្លួន",
    "មជ្ឈមណ្ឌលហ្គេមទាន់សម័យដែលធំជាងគេនៅទីក្រុងភ្នំពេញកំពុងរង់ចាំលោកអ្នក",
    "ក្រុមជម្រើសជាតិទូកនាគកម្ពុជាដណ្តើមបានមេដាយសំរឹទ្ធ១គ្រឿងក្នុងការប្រកួតទូកនាគអន្តរជាតិ នៅប្រទេសរុស្ស៊ី",
    "ពួកម៉ាកល្អបែបនេះ ទៅរកនៅណាបាន",
    "កម្ររកបានណាស់ បានតិចតួចចេះចែកគ្នា",
    "ពួកម៉ាកល្អ មិត្តល្អ សន្យាថាចែកគ្នាស្មើ"

  ];
  
  const masteryParagraphs = [
    "ប្រធានមជ្ឈមណ្ឌលអភិវឌ្ឍន៍សូត្រខ្មែរ បានស្នើសុំដល់រាជរដ្ឋាភិបាលកម្ពុជា ក៏ដូចជាវិស័យឯកជនចូលរួម ជួយជំរុញវិស័យសូត្រនៅក្នុងប្រទេសកម្ពុជានិងការរៀបចំបច្ចេកទេសបានយ៉ាងល្អ ដូច្នេះបូកផ្សំនឹងការរួមចំណែកពីរដ្ឋាភិបាល និងឯកជននោះ វិស័យសូត្រនៅកម្ពុជា នឹងកាន់តែល្អប្រសើរឡើង។​",
    "ជាមួយនឹងអំណរសាទរខួបទី ៧៣ ថ្ងៃបង្កើតគណបក្សប្រជាជនកម្ពុជា សម្តេចតេជោ សូមថ្វាយព្រះពរ ប្រគេនពរ សម្តេចព្រះសង្ឃរាជ ព្រះរាជាគណៈ ព្រះថេរានុថេរៈគ្រប់ព្រះអង្គ និងសូមប្រសិទ្ធពរជូនសម្តេច ឯកឧត្តម លោកជំទាវ គណៈ ដឹកនាំសាសនិកឥស្លាម និងគ្រឹស្តសាសនិក",
    "ភ្ញៀវកិត្តិយសជាតិ និងអន្តរជាតិ សមាជិក សមាជិកានៃអង្គមីខ្ទីង និងបងប្អូនជនរួមជាតិទាំងនៅក្នុងប្រទេស ទាំងនៅក្រៅប្រទេស សូមបានប្រកបនូវពុទ្ធពរ និងពរទាំងប្រាំប្រការ គឺអាយុ វណ្ណៈ សុខៈ ពលៈ និងបដិភាណៈកុំបី ឃ្លៀងឃ្លាតឡើយ",
    "មជ្ឈមណ្ឌលបណ្ដុះធុរកិច្ចថ្មី តេជោ សូមធ្វើការបង្ហាញកម្រងរូបភាពនៃការធ្វើទស្សនកិច្ចតភ្ជាប់ ប្រព័ន្ធអេកូឡូសុីធុរកិច្ចថ្មីនៅប្រទេសវៀតណាម ដែលបានប្រព្រឹត្តិទៅចាប់ពីថ្ងៃទី ២៧ ខែ ឧសភា រហូតដល់ថ្ងៃទី ១ ខែ មិថុនា ឆ្នាំ ២០២៤។",
    "លោកអ្នកអាចជួយការពារទាំងបរិស្ថាន ចំណេញទាំងពេលវេលា និង ចំណេញទាំងថវិកា ដោយគ្រាន់តែប្ដូរមកប្រើមីនុយឌីជីថល!!! ឥឡូវនេះ លោកអ្នកមិនចាំបាច់ព្រីនមីនុយម្ហូបអាហារ ឬភេសជ្ជៈទៀតទេ!!!",
    "ថ្ងៃទី២៧ ខែមិថុនា ឆ្នាំ២០២៤ សហគ្រិនខ្មែរ បានសហការជាមួយអង្គការស្វីសខនថាក់ និងភូមិអុីមផេកបាត់ដំបង រួមគ្នាក្នុងការផ្តួចផ្តើមរៀបចំកម្មវិធី “ជួបជុំមួយថ្ងៃសហគ្រិន” ជាលើកដំបូង នៅក្នុងខេត្តបាត់ដំបង។ ",
    "កម្មវិធីនេះមានគោលបំណង ជម្រុញឲ្យមានការបង្កើតគំនិតច្នៃប្រឌិតថ្មីសម្រាប់ការអភិវឌ្ឍ ផលិតផលធម្មជាតិ អាហារបំប៉នសុខភាព និងគ្រឿងសម្អាងសម្រាប់គុណប្រយោជន៍ដល់សុខភាព មនុស្ស។ ក្នុងនោះផងដែរ កម្មវិធីនេះក៏ជម្រុញ សមត្ថភាពនិស្សិតក្នុងការស្រាវជ្រាវបែបវិទ្យាសាស្រ្ត",
    " ការផ្គត់ផ្គង់ជីកំប៉ុស សម្រាប់ការដាំដុះដំណាំកំពុងមានទីផ្សារល្អ ស្របពេលដែលពលរដ្ឋ​កាន់តែច្រើន​ឡើងនិយម​ដាំដុះបន្លែ ឬដំណាំផ្សេងៗនៅតាមលំនៅដ្ឋាន។ ",
    "តាមរយៈកម្មវិធី ទស្សនៈសហគ្រិន លោក អាល់វីន ដែលជាម្ចាស់អាជីវកម្ម ដាំដុះ នឹងពន្យល់លម្អិតពាក់ព័ន្ធ​អាជីវកម្មផលិតជីកំប៉ុស ក៏ដូចជាទីផ្សារលក់ផលិតផលនេះ។ ",
    "ភ្លៀងធ្លាក់ខ្លាំងមិនធ្លាប់មានក្នុងរយៈពេល ៨៨ឆ្នាំ បានធ្វើឱ្យដំបូលព្រលានយន្តហោះនៅឥណ្ឌាបាក់ធ្លាក់មកយ៉ាងលឿន និងបណ្តាលឱ្យអ្នកដំណើរមួយចំនួនត្រូវបាត់បង់ជីវិតនិងរងរបួស",
    "កិច្ចការងារនេះគឺជាផ្នែកមួយនៃគម្រោង “ជលផលសមុទ្រ និងតំបន់ឆ្នេរប្រកបដោយចីរភាព” ដែលផ្ដោតលើការគាំទ្រដល់ការរីកលូតលាស់នៃធុរកិច្ចថ្មី,​សហគ្រាសធុនតូច​ និងមធ្យម, សហគមន៍នេសាទ និងសហគមន៍តំបន់ការពារធម្មជាតិ នៅតាមបណ្ដាខេត្ដនៅតំបន់ឆ្នេរទាំងបួន។ ",
    "កិច្ចសហការរវាងសហគ្រិនខ្មែរ និងផ្សារទំនើបអ៊ីអនក្នុងការរៀបចំពិព័រណ៍ផលិតផលក្នុងស្រុក។ ការតាំងពិព័រណ៍នេះមានគោលបំណងលើកកម្ពស់ផលិតផលក្នុងស្រុក និង ជីវភាពរបស់ប្រជាកសិករក្នុងស្រុក ព្រមទាំងបើកឱកាសទីផ្សារថ្មី ទាំងក្នុងស្រុក និងអន្តរជាតិ សម្រាប់ផលិតផលក្នុងស្រុក ។ ",
    "មោទកភាពមែនទែន នាំមុខមាត់ខ្មែរមកកាន់មាតុភូមិ អ្នកឧកញ៉ា លាង ម៉េង សហស្ថាបនិកក្រុមហ៊ុន ខ្មែរ ប៊ែវើរីជីស ទោះជារវល់យ៉ាងណាក៏ឆ្លៀតពេលអញ្ជើញផ្ទាល់ទៅទទួលកីឡាករគុនខ្មែរ ឈឿង ល្វៃ និងសុខធី ជាពិសេសឧបត្ថម្ភទឹកប្រាក់លើកទឹកចិត្តបន្ថែមទៀត",
    "ហគ្រិនខ្មែរ ក្នុងនាមជាដៃគូ រៀបចំកម្មវិធី ពន្លឿនអាជីវកម្មថ្នាលឌីជីថលរដូវកាលទី ៣   សូមអបអរសាទរដល់ធុរកិច្ចឆ្នើមទាំង ៥ ក្រុមដែលបានមកដល់វគ្គ«ថ្ងៃបទបង្ហាញសាធារណៈ»",
    "សហគ្រិនខ្មែរសូមអញ្ជីញដៃគូដែលមានចំណាប់អារម្មណ៍ចូលរួមដាក់ពាក្យផ្ដល់សេវាកម្ម បង្កើតយុទ្ធវិធី និង កម្មវិធីសិក្សាក្នុងគម្រោងពន្លឿនអាជីវកម្មសម្រាប់សហគ្រិននៅតាមបណ្តាខេត្ត។",
    "នាថ្ងៃទី២៨ ខែមិថុនា ឆ្នាំ២០២៤ សហគ្រិនខ្មែរ ដែលជាស្ថាប័នដែលបង្កើតឡើងក្រោមគំនិតផ្តួចផ្តើមរបស់ រាជរដ្ឋាភិបាលក្នុងគោលបំណងជំរុញការអភិវឌ្ឍប្រព័ន្ធអេកូឡូស៊ីសហគ្រិនឲ្យរស់រវើកនៅកម្ពុជា ",
    "សូមញ្ជើញចូលរួមទស្សនាឲ្យបានច្រើនកុះករនៃការប្រកួតកីឡាវាយសីសម្រាប់កីឡាករមិនមែនអាជីពក្រោយពីពិធីបើកជាផ្លូវការដែលនឹងប្រព្រឹត្តិទៅនៅថ្ងៃទី២៩ ខែមិថុនាខាងមុខនេះ!",
    "រ៉េខាងត្បូង៖ អាកាសយានដ្ឋានអន្តរជាតិ បស់ប្រទេសកូរ៉េខាងត្បូង ត្រូវបានបិទផ្លូវរត់រយៈពេលប្រហែល ៣ម៉ោង កាលពីថ្ងៃទី២៦ ខែមិថុនា ឆ្នាំ២០២៤ ម្សិលមិញនេះ ដោយសារតែការបង្ហោះបាឡុងសំរាមមកពីប្រទេសកូរ៉េខាងជើង",
    "ក្នុងអំឡងពេលប្រកួតនេះបានបង្កើតព្រឹត្តិការណ៍ អេក្រង់យក្ស ទស្សនាបាល់ទាត់ទ្វីបអ៊ឺរ៉ុប! ដែលមានការរៀបចំហ្គេម ឈ្មោះថា Penalty យកលុយសុទ្ធងាយៗស្រួលៗទទួលបានប្រាក់រង្វាន់ ពេលការចូលលេងរាប់រយដុល្លារ។",
    "កម្មវិធីតោះអាន! កំពុងស្វែងរកវិចិត្រករ និង អ្នករចនាទំព័រសៀវភៅ ដើម្បីចូលរួមក្នុងកម្មវិធីហាក់កាសន សៀវភៅអេឡិចត្រូនិច ដែលនឹងប្រព្រឹត្តិទៅនៅថ្ងៃទី ១៩ និង​ ២០ ខែសីហា ឆ្នាំ២០១៧។ ក្នុងកម្មវិធីនេះ អ្នកនិពន្ធ វិចិត្រករ និង អ្នករចនាទំព័រសៀវភៅ នឹងធ្វើការជាមួយគ្នា ",
    "កម្មវិធីហាក់កាសនតោះអាន! បានប្រព្រឹត្តិទៅដោយជោគជ័យ! សូមអរគុណអ្នកចូលរួមទាំងអស់ដែលមានអ្នកនិពន្ធ វិចិត្រករ និង អ្នករចនាទំព័រ ដែលបានខិតខំប្រឹងប្រែងធ្វើការជាមួយគ្នា ដើម្បីបង្កើតសៀវភៅកុមារក្រោមប្រធានបទ “ស្រ្តីអាចធ្វើអ្វីៗបានទាំងអស់” ។",
    "គម្រោង តោះអាន! កំពុងស្វែងរកអ្នកនិពន្ធដើម្បីចូលរួមបង្កើតសៀវភៅអេឡិចត្រូនិចតាមរយៈកម្មវិធីហាក់កាសន តោះអាន! នៅថ្ងៃទី១៩ ខែមិនា ឆ្នាំ២០១៧ "
  ];
  const wordParagraphs = [
    "ស្នេហា",
    "ប៉ា",
    "ម៉ាក់",
    "សូមអរគុណ",
    "ដួងចិត្ត",
    "សម្រស់ ",
    "នំបញ្ចុក",
    "ភាសាអង់គ្លេស",
    "ឧត្តមភាព",
    "សៀវភៅ",
    "កាបូប",
    "ទូរស័ព្ទ",
    "ប្អូន",
    "ផ្លែឈើ",
    "សាច់",
    "សណ្ឋាគារ",
    "ភោជនីយដ្ឋាន",
    "ដើរ",
    "រត់",
    "ព្រៃ",
    "រូបថត",
    "កាមេរ៉ា",
    "ការិយាល័យ",
    "ចំនួន",
    "ទីស្នាក់ការ",
    "ក្លឹប",
    "អបអរសាទរ",
    "អក្សរ",
    "អត់ធ្មត់",
    "អណ្តើក",
    "អំបោះ",
    "អំពិល",
    "អំពៅ",
    "អន្តរាគមន៍ ",
    "អញ្ចើញ",
    "អញ្ចឹង",
    "អណ្តែត",
    "អំឡុងពេល",
    "អង្គុយ",
    "អចលនទ្រព្យ",
    "អំណាច",
    "អាណាចក្រ",
    "អាជ្ញា",
    "ស្រស់",
    "ផ្លែឈើ",
    "ល្អ",
    "អាល័យ",
    "អត្រា",
    "ថ្ងៃ",
    "សីហា",
    "កំហុស",
    "ខែ",
    "ឆ្កួត",
    "បើកបរ",
    "ថ្ងៃព្រហស្បតិ៍",
    "សប្ដាហ៍ចុងសប្ដាហ៍",
    "ខែធ្នូ",
    "ប្រកាស",
    "អត្ថប្រយោជន៍",
    "ផ្លែប៉ោម",
    "ទឹកក្រូច",
    "ភេទ",
    "អាក្រក់",
    "ផ្លែប៉ែស",
    "ពេញនិយម",
    "ការលែងលះ",
    "ខែវិច្ឆិកា",
    "និយាយ",
    "ការបោះចោល",
    "ស្រែក",
    "សម្រស់ "
  ];
  
  let currentParagraphs = beginnerParagraphs;
  let maxTime = 60;
  let timeLeft = maxTime;
  let charIndex = mistakes = isTyping = 0;
  
  const typingText = document.querySelector(".typing-text p");
  const inpField = document.querySelector(".wrapper .input-field");
  const tryAgainBtn = document.querySelector(".content button");
  const timeTag = document.querySelector(".time span b");
  const mistakeTag = document.querySelector(".mistake span");
  const wpmTag = document.querySelector(".wpm span");
  const cpmTag = document.querySelector(".cpm span");
  const levelSelect = document.querySelector("#testConfig .row .textButton");
  
  function loadParagraph() {
    const ranIndex = Math.floor(Math.random() * currentParagraphs.length);
    typingText.innerHTML = "";
    currentParagraphs[ranIndex].split("").forEach(char => {
      let span = `<span>${char}</span>`;
      typingText.innerHTML += span;
    });
    typingText.querySelectorAll("span")[0].classList.add("active");
    document.addEventListener("keydown", () => inpField.focus());
    typingText.addEventListener("click", () => inpField.focus());
  }
  
  function initTyping() {
    let characters = typingText.querySelectorAll("span");
    let typedChar = inpField.value.split("")[charIndex];
    if (charIndex < characters.length - 1 && timeLeft > 0) {
      if (!isTyping) {
        timer = setInterval(initTimer, 1000);
        isTyping = true;
      }
      if (typedChar == null) {
        if (charIndex > 0) {
          charIndex--;
          if (characters[charIndex].classList.contains("incorrect")) {
            mistakes--;
          }
          characters[charIndex].classList.remove("correct", "incorrect");
        }
      } else {
        if (characters[charIndex].innerText == typedChar) {
          characters[charIndex].classList.add("correct");
        } else {
          mistakes++;
          characters[charIndex].classList.add("incorrect");
        }
        charIndex++;
      }
      characters.forEach(span => span.classList.remove("active"));
      characters[charIndex].classList.add("active");
  
      let wpm = Math.round(((charIndex - mistakes) / 5) / (maxTime - timeLeft) * 60);
      wpm = wpm < 0 || !wpm || wpm === Infinity ? 0 : wpm;
  
      wpmTag.innerText = wpm;
      mistakeTag.innerText = mistakes;
      cpmTag.innerText = charIndex - mistakes;
    } else {
      clearInterval(timer);
      inpField.value = "";
      showResult(); // Call the showResult() function here
    }
  }
  
  function initTimer() {
    if (timeLeft > 0) {
      timeLeft--;
      timeTag.innerText = timeLeft;
      let wpm = Math.round(((charIndex - mistakes) / 5) / (maxTime - timeLeft) * 60);
      wpmTag.innerText = wpm;
    } else {
      clearInterval(timer);
    }
  }
  
  function resetGame() {
    loadParagraph();
    clearInterval(timer);
    timeLeft = maxTime;
    charIndex = mistakes = isTyping = 0;
    inpField.value = "";
    timeTag.innerText = timeLeft;
    wpmTag.innerText = 0;
    mistakeTag.innerText = 0;
    cpmTag.innerText = 0;
  }
  
  function setTime(time) {
    maxTime = time;
    timeLeft = maxTime;
    timeTag.innerText = timeLeft;
  }
  
  function setMode(mode) {
    switch (mode) {
      case "beginner":
        currentParagraphs = beginnerParagraphs;
        break;
      case "advanced":
        currentParagraphs = advancedParagraphs;
        break;
      case "mastery":
        currentParagraphs = masteryParagraphs;
        break;
      case "word":
        currentParagraphs = wordParagraphs;
        break;
    }
    resetGame();
  }
  
function showResult() {
  const resultModal = document.querySelector(".modal");
  resultModal.style.display = "block";

  const resultContent = document.querySelector(".modal-content");
  resultContent.innerHTML = `
    <canvas id="graph" style="width: 100%; height: 300px;"></canvas>
    <div style="display: flex; flex-direction: row; justify-content: space-between; margin-top: 20px;">
      <span id="result-wpm" style="flex: 1;">WPM: ${wpmTag.innerText}</span>
      <span id="result-time" style="flex: 1;">Time: ${timeTag.innerText} seconds</span>
      <span id="result-cpm" style="flex: 1;">CPM: ${cpmTag.innerText}</span>
      <span id="result-mistakes" style="flex: 1;">Mistakes: ${mistakeTag.innerText}</span>
    </div>
  `;

  const ctx = document.getElementById("graph").getContext("2d");
  new Chart(ctx, {
    type: "bar",
    data: {
      labels: ["WPM", "CPM", "Mistakes"],
      datasets: [{
        label: "Results",
        data: [wpmTag.innerText, cpmTag.innerText, mistakeTag.innerText],
        backgroundColor: [
          "rgba(255, 99, 132, 0.2)",
          "rgba(54, 162, 235, 0.2)",
          "rgba(255, 206, 86, 0.2)"
        ],
        borderColor: [
          "rgba(255, 99, 132, 1)",
          "rgba(54, 162, 235, 1)",
          "rgba(255, 206, 86, 1)"
        ],
        borderWidth: 1
      }]
    },
    options: {
      scales: {
        y: {
          beginAtZero: true
        }
      }
    }
  });

  const closeButton = document.createElement("span");
  closeButton.className = "close";
  closeButton.innerHTML = "&times;";
  closeButton.onclick = () => {
    resultModal.style.display = "none";
  };
  resultContent.appendChild(closeButton);
}
  
  loadParagraph();
  inpField.addEventListener("input", initTyping);
  tryAgainBtn.addEventListener("click", resetGame);